soap/src/test/resources/org/switchyard/component/soap/wrappedReply.xml

<?xml version="1.0" ?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Body>
		<urn:submit xmlns:urn="urn:test:unwrapped">
		   <invoice>
		      <amount>100.00</amount>
		      <daysOut>50</daysOut>
		   </invoice>
		</urn:submit>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>